app/views/users/index.html.erb

     <%= link_to user do %>
     <h3 class="tu"><%= user.profile.first_name %> <%= user.profile.last_name %></h3>
---
SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 2]]