app/views/users/show.html.erb

<%= @user.profile.first_name %> <%= @user.profile.last_name %></br>
---
SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 28]]