app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("comments", "created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comments", ""], ["created_at", "2016-05-05 21:10:51.800631"], ["email", "jrad.wissal@gmail.com"], ["name", "wissal"], ["updated_at", "2016-05-05 21:10:51.800631"]]
---
    def create
        @contact = Contact.new(contact_params)

    if @contact.save