app/controllers/profiles_controller.rb

 def new
     @user = User.find( params[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 27  ORDER BY "users"."id" ASC LIMIT 1

 def create
     @user = User.find( params[:user_id] )
     @profile = @user.build_profile(profile_params)
    if @profile.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 31  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "profiles" ("avatar_content_type", "avatar_file_name", "avatar_file_size", "avatar_updated_at", "contact_email", "created_at", "description", "first_name", "job_title", "last_name", "phone_number", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "profiles" SET "updated_at" = ?, "user_id" = ? WHERE "profiles"."id" = 1  [["updated_at", "2016-06-21 15:03:18.338569"], ["user_id", nil]]

 def edit
     @user = User.find( params[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 9  ORDER BY "users"."id" ASC LIMIT 1

  def update

     @user=User.find( params[:user_id] )
     @profile = @user.profile
     if @profile.update_attributes(profile_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 9  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "profiles" SET "avatar_file_name" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "profiles"."id" = 5  [["avatar_file_name", "128.jpg"], ["avatar_updated_at", "2016-06-30 10:35:33.360014"], ["updated_at", "2016-06-30 10:35:33.547874"]]